[
  {
    "imageLink": "ProgrammingLanguages",
    "imageAlt": "github profile",
    "title": "PROGRAMMING LANGUAGES",
    "subtitle": "JAVA, C++, OBJECTIVE-C & MORE...",
    "text": "At the age of 12, I started coding with Microsoft SmallBasic. Next year, I walked out of a bookstore with a C# book in my hand. Then, started making Windows Desktop apps. Mobile technologies were rapidly developing at that time so I kept learning about mobile technologies. With the little C# knowledge I had, I made QNote and PhotoSec for Windows Phone. Then continued on with other platforms and other technologies. Now I am comfortable working with many programming languages and frameworks. We all start from somewhere!",
    "rightAlign": false
  },
  {
    "imageLink": "Design",
    "imageAlt": "brain storming and design",
    "title": "DESIGN",
    "subtitle": "PHOTOSHOP, ILLUSTRATOR & A PENCIL",
    "text": "Design is as equally important as the engineering behind the product. Each time I'm working on something new, I constantly ask myself about how the user is going to interact with it. I like prototyping with a pen and paper helps a lot because it forces you to draw the most essential components first, rather than thinking about limitations. This way, you understand your requirements better. Once you understand this relationship between your product and its user, everything just gets magical.",
    "rightAlign": true
  },
  {
    "imageLink": "Sports",
    "imageAlt": "parkour moves",
    "title": "SPORTS",
    "subtitle": "PARKOUR & FREERUNNING",
    "text": "Sitting in front of a computer screen is not a part of our job, it is a choice. I enjoy physical activities as much as I do programming. I've played tennis some years ago. Now I do parkour. It has been almost 6 years now since I've started. I've started in high school, then went to uni to create my own parkour society. Also, I quite enjoy snowboarding. Check my Instagram and other social media accounts for my parkour and snowboarding videos!",
    "rightAlign": false
  }
]